app/controllers/especialidades_controller.rb

  def index
    @especialidades = Especialidade.all
---
SELECT * FROM "especialidades"

  def show
    @especialidade = Especialidade.find(params[:id])
---
SELECT * FROM "especialidades" WHERE ("especialidades"."id" = 1)

  def create
    @especialidade = Especialidade.new(params[:especialidade])

    respond_to do |format|
      if @especialidade.save
---
INSERT INTO "especialidades" ("updated_at", "cantidad_modulos", "cupo_max", "costo_matricula", "nombre_especialidad", "costo_modulo", "cupo_min", "duracion_modulo", "created_at") VALUES('2007-12-15 19:08:25', 12, 20, 100.0, 'ingles', 120.0, 10, '1 mes', '2007-12-15 19:08:25')