app/controllers/estudiantes_controller.rb

  def index
    @estudiantes = Estudiante.all
---
SELECT * FROM "estudiantes"

  def show
    @estudiante = Estudiante.find(params[:id])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)

  def edit
    @estudiante = Estudiante.find(params[:id])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 2)

  def create
    @estudiante = Estudiante.new(params[:estudiante])

    respond_to do |format|
      if @estudiante.save
---
INSERT INTO "estudiantes" ("a_paterno", "updated_at", "nombre_usuario", "nombre", "correo", "a_materno", "ci", "password", "telefono", "created_at") VALUES('gu', '2007-12-15 21:42:58', 'marisa', 'marisabel', '', '', '', '123456', '', '2007-12-15 21:42:58')

  def update
    @estudiante = Estudiante.find(params[:id])

    respond_to do |format|
      if @estudiante.update_attributes(params[:estudiante])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 2)
UPDATE "estudiantes" SET "nombre_usuario" = 'marisa', "updated_at" = '2007-12-15 23:05:24' WHERE "id" = 2

  def destroy
    @estudiante = Estudiante.find(params[:id])
    @estudiante.destroy
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."id" = 1)
DELETE FROM "estudiantes" WHERE "id" = 1