app/controllers/horarios_controller.rb

SELECT * FROM "horarios"
---
  def index
    @horarios = Horario.all

SELECT * FROM "horarios" WHERE ("horarios"."id" = 1)
---
  def show
    @horario = Horario.find(params[:id])

INSERT INTO "horarios" ("horas", "dias", "updated_at", "nombre_especialidad", "created_at") VALUES('8:30 a 12:00', 'lunes a viernes', '2007-12-15 19:11:45', 'ingles', '2007-12-15 19:11:45')
---
  def create
    @horario = Horario.new(params[:horario])

    respond_to do |format|
      if @horario.save