app/controllers/reservas_controller.rb

SELECT * FROM "reservas"
---
  def index
    @reservas = Reserva.all

SELECT * FROM "reservas" WHERE ("reservas"."id" = 1)
---
  def show
    @reserva = Reserva.find(params[:id])

SELECT * FROM "reservas" WHERE ("reservas"."id" = 1)
---
  def edit
    @reserva = Reserva.find(params[:id])

INSERT INTO "reservas" ("r_nombre", "updated_at", "r_correo", "r_hora", "r_a_paterno", "r_a_materno", "nombre_especialidad", "r_dia", "created_at") VALUES('', '2007-12-15 22:19:34', '', '', '', '', '', '', '2007-12-15 22:19:34')
---
  def create
    @reserva = Reserva.new(params[:reserva])

    respond_to do |format|
      if @reserva.save