app/controllers/session_controller.rb

  def create
    # Buscamos con este metodo mediante el login
    @estudiante = Estudiante.find_by_nombre_usuario(params[:estudiante][:nombre_usuario])
---
SELECT * FROM "estudiantes" WHERE ("estudiantes"."nombre_usuario" = 'hh') LIMIT 1